Revit 2024 API
FilledRegionType.BackgroundPatternId Property
 The background fill pattern Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId BackgroundPatternId { get; set; }
Visual Basic
Public Property BackgroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BackgroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The FillPattern used for a background pattern must have a 'Drafting' target. This applies to both project and family elements. In addition, when the FilledRegionAttributes element is in a family, the pattern cannot be the solid fill pattern unless the 'IsMasking' property is set to true. InvalidElementId is used when there is no background pattern
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The patternId must either be InvalidElementId or represent a valid FillPatternElement. -or- When setting this property: The patternId must be a 'Drafting' pattern. -or- When setting this property: In a family the patternId can not be a solid fill pattern if the 'IsMasking' property is false.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace